laminarVortexShedding/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         200;

deltaT          0.01;

writeControl    adjustableRunTime;

writeInterval   2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


// ************************************************************************* //
functions
{

forces
{
    type                forces;
    functionObjectLibs  ("libforces.so");
    outputControl       timeStep;
    outputInterval      10;

    patches             ( "cylinder" );
    pName               p;
    UName               U;
    rhoName             rhoInf;
    log                 true;
    CofR                (0 0 0);
    rhoInf              1.225;
}


forceCoeffs
{
    type                forceCoeffs;
    functionObjectLibs  ( "libforces.so" );
    outputControl       timeStep;
    outputInterval      10;

    patches             ( "cylinder" );
    pName               p;
    UName               U;
    rhoName             rhoInf;
    log                 true;

    liftDir             (0 1 0);
    dragDir             (1 0 0);
    CofR                (0 0 0);
    pitchAxis           (0 0 1);

    magUInf             1;
    rhoInf              1.225;
    lRef                1;
    Aref                2;
}

}
